<script setup>
const props = defineProps(["termsType"]);
</script>
<template>
  <v-sheet class="pa-8">
    <v-container v-if="termsType == 'termsServiceUseAg'">
      <v-card-title class="text-center mb-10">서비스 이용약관</v-card-title>
      <v-row>
        <v-col>
          <p class="smallBoldText">제1조(목적)</p>
          <p>
            이 약관은 현대엘리베이터(주) (이하 '회사' 라고 합니다)가 제공하는 MIRI 서비스
            고객포탈의 이용과 관련하여 회사와 회원과의 권리, 의무 및 책임사항, 기타 필요한
            사항을 규정함을 목적으로 합니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제2조(정의)</p>
          <p>이 약관에서 사용하는 주요 용어의 정의는 다음과 같습니다.</p>
          <ol>
            <li>
              1. '서비스'라 함은 구현되는 단말기(PC, 휴대형단말기 등의 각종 유무선 장치를
              포함)와 상관없이 '이용자'가 이용할 수 있는 회사가 제공하는 제반 서비스를
              의미합니다.
            </li>
            <li>
              2. '이용자'란 이 약관에 따라 회사가 제공하는 서비스를 받는 '입주민',
              '건물관리인', ‘메이저 고객’ 및 '현대엘리베이터 직원'을 말합니다.
            </li>
            <li>
              3. '입주민'은 ‘건물관리인’에게 개인정보를 제공하여 회원등록을 한 사람으로,
              회사로부터 지속적으로 정보를 제공받고 '회사'가 제공하는 서비스를 계속적으로
              이용할 수 있는 자를 말합니다.
            </li>
            <li>
              4. '건물관리인'은 회사에 승강기정보, 현장정보 및 개인정보를 제공하여
              회원등록을 한 사람으로, 회사로부터 지속적으로 정보를 제공받고 회사가
              제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다. 또한
              ‘건물관리인’은 ‘입주민’의 회원가입을 승인하고 회사로부터 ‘입주민’에게 정보
              제공 여부를 관리합니다.
            </li>
            <li>
              5. ‘메이저 고객’은 회사에 다수의 승강기정보, 현장정보 및 개인정보를 제공하여
              회원등록을 한 사람으로, 회사로부터 지속적으로 여러 현장의 정보를 일괄
              제공받고 회사가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
            </li>
            <li>
              6. '현대엘리베이터 영업사원'은 회원가입 없이 회사가 제공하는 서비스를
              이용하는 자를 말합니다. 또한 ‘현대엘리베이터 영업사원’은 ‘건물관리인’과
              ‘메이저 고객’의 회원가입을 승인하고 회사로부터 ‘건물관리인’과 ‘메이저
              고객’에게 정보 제공 여부를 관리합니다.
            </li>
            <li>
              7. '아이디(ID)'라 함은 서비스이용을 위하여 회원이 정하고 회사가 승인하는
              전자우편을 말합니다.
            </li>
            <li>
              8. '비밀번호'라 함은 회원이 부여받은 아이디와 일치되는 회원임을 확인하고
              비밀의 보호를 위해 회원 자신이 정한 문자(특수문자 포함)와 숫자의 조합을
              의미합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제3조(약관 외 준칙)</p>
          <p>
            이 약관에서 정하지 아니한 사항에 대해서는 법령 또는 회사가 정한 서비스의
            개별약관, 운영정책 및 규칙 등(이하 세부지침)의 규정에 따릅니다. 또한 본 약관과
            세부지침이 충돌할 경우에는 세부지침에 따릅니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제4조(약관의 효력과 변경)</p>
          <ol>
            <li>
              1. 이 약관은 현대엘리베이터(주)가 제공하는 MIRI 서비스 고객포탈 웹서비스와
              모바일서비스에 게시하여 공시합니다. 회사는 '약관의 규제에 관한 법률(이하'
              약관규제법'이라 함)', '정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하
              '정보통신망법'이라 함)' 등 본 서비스와 관련된 법령에 위배되지 않는 범위에서
              이 약관을 변경할 수 있으며, 회사는 약관이 변경되는 경우에 변경된 약관의
              내용과 시행일을 정하여, 그 시행일로부터 최소 7일 (이용자에게 불리하거나
              중대한 사항의 변경은 30일) 이전부터 시행일 후 상당한 기간 동안 공지하고,
              기존 이용자에게는 변경된 약관, 적용일자 및 변경사유(변경될 내용 중
              중요사항에 대한 설명을 포함)를 별도의 전자적 수단(전자우편, 문자메시지,
              서비스 내 공지사항 발송, 알림 메시지를 띄우는 등의 방법)으로 개별
              통지합니다. 변경된 약관은 공지하거나 통지한 시행일로부터 효력이 발생합니다.
            </li>
            <li>
              2. 회사가 제1항에 따라 개정약관을 공지 또는 통지하는 경우 '변경에 동의하지
              아니한 경우 공지일 또는 통지를 받은 날로부터 7일(이용자에게 불리하거나
              중대한 사항의 변경인 경우에는 30일) 내에 계약을 해지할 수 있으며, 계약해지의
              의사표시를 하지 아니한 경우에는 변경에 동의한 것으로 본다.' 라는 취지의
              내용을 함께 통지합니다.
            </li>
            <li>
              3. 이용자가 제2항의 공지일 또는 통지를 받은 날로부터 7일(또는 이용자에게
              불리하거나 중대한 사항의 변경인 경우에는 30일)내에 변경된 약관에 대해 거절의
              의사를 표시하지 않았을 때에는 본 약관의 변경에 동의한 것으로 간주합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제5조(이용자에 대한 통지)</p>
          <ol>
            <li>
              1. 회사는 이 약관에 별도 규정이 없는 한 이용자에게 전자우편,
              문자메시지(SMS), 전자쪽지, 푸시(Push)알림 등의 전자적 수단을 이용하여 통지할
              수 있습니다.
            </li>
            <li>
              2. 회사는 이용자 전체에 대한 통지의 경우 7일 이상 회사가 운영하는 웹사이트
              내의 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다. 다만, 이용자
              본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 제1항의 개별
              통지를 합니다.
            </li>
            <li>
              3. 회사는 이용자의 연락처 미기재, 변경 후 미수정, 오기재 등으로 인하여 개별
              통지가 어려운 경우에 한하여 전항의 공지를 함으로써 개별 통지를 한 것으로
              간주합니다.
            </li>
          </ol>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제6조(이용계약의 체결)</p>
          <p>이용계약은 다음의 경우에 체결됩니다.</p>
          <ol>
            <li>
              1. 이용자가 회원으로 가입하고자 하는 경우 이용자가 약관의 내용에 대하여
              동의를 한 다음 회원가입신청을 하고 회사가 이러한 신청에 대하여 승낙한 때
            </li>
            <li>
              2. 이용자가 회원가입 없이 이용할 수 있는 서비스에 대하여 회원가입의 신청없이
              무료 서비스를 이용하고자 하는 경우에는 그 무료 서비스와 관련된 사항의 저장
              등 부가서비스를 이용하면서 위 1호의 절차를 진행한 때
            </li>
          </ol>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제7조(회원가입에 대한 승낙)</p>
          <ol>
            <li>
              1. 회사는 이용계약에 대한 요청이 있을 때 이용에 적합한 사용자의 확인 및 인가
              후 서비스 이용을 승낙함을 원칙으로 합니다.
            </li>
            <li>
              2. 전항에도 불구하고, 다음 각호의 사유에 해당하는 경우 회사는 회원가입을
              보류하거나 거절하는 등 제한할 수 있습니다.
              <ol>
                <li>
                  1. 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는
                  경우(단, 회사의 재가입 승낙을 얻은 경우에는 예외로 함)
                </li>
                <li>2. 실명이 아니거나 타인의 명의를 도용한 경우</li>
                <li>3. 회사가 정하는 필수정보를 누락하거나 허위로 기재한 경우</li>
                <li>
                  4. 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 이 약관 등 회사가
                  규정한 운영원칙을 위반한 경우
                </li>
                <li>
                  5. 신용정보의 이용과 보호에 관한 법률에 따라 PC통신, 인터넷서비스의
                  신용불량자로 등록되어 있는 경우
                </li>
                <li>
                  6. 정보통신윤리위원회에 PC통신, 인터넷서비스의 불량이용자로 등록되어
                  있는 경우
                </li>
                <li>
                  7. 이미 사용 중인 회원정보 또는 공서양속을 저해하는 아이디를 사용하고자
                  하는 경우
                </li>
                <li>
                  8. 회원가입 승인권자의 판단으로 회원가입 희망자의 자격이 적절하지 않은
                  경우
                </li>
              </ol>
            </li>

            <li>
              3. 제1항에 따른 신청에 있어 회사는 서비스 제공에 필요한 경우 전문기관을 통한
              실명확인 및 본인인증을 요청할 수 있습니다.
            </li>
            <li>
              4. 회사는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는
              경우에는 승낙을 유보할 수 있습니다.
            </li>
            <li>
              5. 약관 승인 절차에 따라 서비스 이용을 승낙하지 아니하거나 유보한 경우,
              회사는 원칙적으로 이를 서비스 이용 신청자에게 알리도록 합니다. 단, 회사의
              귀책사유 없이 이용자에게 알릴 수 없는 경우에는 예외로 합니다.
            </li>
            <li>
              6. 회사는 회원에 대해 회사정책에 따라 등급별로 구분하여 이용시간, 이용횟수,
              서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.
            </li>
          </ol>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제8조(회원정보의 변경)</p>
          <li>
            1. 회원은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할
            수 있습니다. 다만, 서비스 관리를 위해 필요한 실명, 아이디 등은 수정이
            불가능합니다.
          </li>
          <li>
            2. 회원은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을
            하거나 전자우편 기타 방법으로 회사에 대하여 그 변경사항을 알려야 합니다.
          </li>
          <li>
            3. 제2항의 변경사항을 회사에 알리지 않아 발생한 불이익에 대하여는 회원에게
            책임이 있습니다.
          </li>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제9조(회원정보의 관리 및 보호)</p>
          <ol>
            <li>
              1. 회원의 아이디(ID)와 비밀번호에 관한 관리책임은 회원에게 있으며, 이를
              제3자가 이용하도록 하여서는 안 됩니다.
            </li>
            <li>
              2. 회사는 회원의 아이디(ID)가 개인정보 유출 우려가 있거나, 반사회적 또는
              공서양속에 어긋나거나, 회사 또는 서비스의 운영자로 오인할 우려가 있는 경우,
              해당 아이디(ID)의 이용을 제한할 수 있습니다.
            </li>
            <li>
              3. 회원은 아이디(ID) 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한
              경우에는 이를 즉시 회사에 통지하고 안내에 따라야 합니다.
            </li>
            <li>
              4. 제3항의 경우 해당 회원이 회사에 그 사실을 통지하지 않거나, 통지하였으나
              회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제10조(회사의 의무)</p>
          <ol>
            <li>
              1. 회사는 계속적이고 안정적인 서비스의 제공을 위하여 설비에 장애가 생기거나
              멸실된 때에는 이를 지체 없이 수리 또는 복구하며, 다음 각 호의 사유 발생 시
              부득이한 경우 예고 없이 서비스의 전부 또는 일부의 제공을 일시 중지할 수
              있습니다. 이 경우 그 사유 및 중지 기간 등을 이용자에게 지체 없이 사후
              공지합니다.
              <ol>
                <li>
                  1. 시스템의 긴급점검, 증설, 교체, 시설의 보수 또는 공사를 하기 위하여
                  필요한 경우
                </li>
                <li>
                  2. 새로운 서비스를 제공하기 위하여 시스템교체가 필요하다고 판단되는 경우
                </li>
                <li>
                  3. 시스템 또는 기타 서비스 설비의 장애, 유무선 Network 장애 등으로
                  정상적인 서비스 제공이 불가능할 경우
                </li>
                <li>4. 국가비상사태, 정전, 불가항력적 사유로 인한 경우</li>
              </ol>
            </li>
            <li>
              2. 회사는 이용계약의 체결, 계약사항의 변경 및 해지 등 이용자와의 계약관련
              절차 및 내용 등에 있어 이용자에게 편의를 제공하도록 노력합니다.
            </li>
            <li>
              3. 회사는 대표자의 성명, 상호, 주소, 전화번호, 모사전송번호(FAX), 이용약관,
              개인정보취급방침 등을 이용자가 쉽게 알 수 있도록 온라인 서비스 초기화면에
              게시합니다.
            </li>
          </ol>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제11조(개인정보보호)</p>
          <ol>
            <li>
              1. 회사는 이용자들의 개인정보를 중요시하며, 정보통신망 이용촉진 및 정보보호
              등에 관한 법률, 개인정보보호법 등 관련 법규를 준수하기 위해 노력합니다.
              회사는 개인정보보호정책을 통하여 이용자가 제공하는 개인정보가 어떠한 용도와
              방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지
              알려드립니다.
            </li>
            <li>
              2. 회사는 최종 사용일로부터 연속하여 1년 동안 서비스 사용 이력이 없는 경우
              '개인정보보호법' 및 같은 법 시행령의 규정에 따라 이용자정보를 다른 이용자의
              개인정보와 분리하여 별도로 저장 및 관리할 수 있습니다. 이때 분리 저장된
              이용자의 개인정보는 이용자가 회원탈퇴 신청 또는 개인정보삭제 요청을 할
              때까지 보관됩니다.
            </li>
            <li>
              3. 회사가 이용자의 개인정보의 보호 및 사용에 대해서 관련 법규 및 회사의
              개인정보처리방침을 적용합니다. 다만, 회사에서 운영하는 웹 사이트 등에서
              링크된 외부 웹페이지에서는 회사의 개인정보처리방침이 적용되지 않습니다.
            </li>
          </ol>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제12조(이용자의 의무)</p>
          <ol>
            <li>
              1. 이용자는 이용자가입을 통해 이용신청을 하는 경우 사실에 근거하여 신청서를
              작성해야 합니다. 이용자가 허위, 또는 타인의 정보를 등록한 경우 회사에 대하여
              일체의 권리를 주장할 수 없으며, 회사는 이로 인하여 발생한 손해에 대하여
              책임을 부담하지 않습니다.
            </li>
            <li>
              2. 이용자는 본 약관에서 규정하는 사항과 기타 회사가 정한 제반 규정, 회사가
              공지하는 사항을 준수하여야 합니다. 또한 이용자는 회사의 업무를 방해하는 행위
              및 회사의 명예를 훼손하는 행위를 하여서는 안 됩니다.
            </li>
            <li>
              3. 이용자는 주소, 연락처, 전자우편 주소 등 회원정보가 변경된 경우 즉시
              온라인을 통해 이를 수정해야 합니다. 이 때 변경된 정보를 수정하지 않거나
              수정이 지연되어 발생하는 책임은 이용자가 지게 됩니다.
            </li>
            <li>
              4. 이용자는 이용자에게 부여된 아이디와 비밀번호를 직접 관리해야 합니다.
              이용자의 관리 소홀로 발생한 문제는 회사가 책임을 부담하지 않습니다.
            </li>
            <li>
              5. 이용자가 아이디, 서비스 내에서 사용되는 명칭 등을 선정할 때에는 다음 각
              호에 해당하는 행위를 해서는 안 됩니다.
              <ol>
                <li>
                  1. 회사가 제공하는 서비스의 공식 운영자를 사칭하거나 이와 유사한 명칭을
                  사용하여 다른 이용자에게 혼란을 주는 행위
                </li>
                <li>2. 선정적이고 음란한 내용이 포함된 명칭을 사용하는 행위</li>
                <li>
                  3. 제3자의 상표권, 저작권 등 권리를 침해할 가능성이 있는 명칭을 사용하는
                  행위
                </li>
                <li>
                  4. 제3자의 명예를 훼손하거나, 그 업무를 방해할 가능성이 있는 명칭을
                  사용하는 행위
                </li>
                <li>
                  5. 기타 반사회적이고 관계법령에 저촉되는 내용이 포함된 명칭을 사용하는
                  행위
                </li>
                <li>
                  6. 이용자는 회사의 명시적 동의가 없는 한 서비스 이용 권한, 기타 이용
                  계약상의 지위에 대하여 매도, 증여, 담보제공 등 처분행위를 할 수
                  없습니다.
                </li>
                <li>
                  7. 본 조와 관련하여 서비스 이용에 있어 주의사항 등 그 밖의 자세한 내용은
                  운영정책으로 정하며, 이용자가 서비스 이용약관 및 운영정책을 위반하는
                  경우 서비스 이용제한, 민형사상의 책임 등 불이익이 발생할 수 있습니다.
                </li>
              </ol>
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제13조(서비스의 제공)</p>
          <ol>
            <li>
              1. 회사의 서비스는 연중무휴, 1일 24시간 제공을 원칙으로 합니다. 다만 회사
              시스템의 유지 보수를 위한 점검, 통신장비의 교체 등 특별한 사유가 있는 경우
              서비스의 전부 또는 일부에 대하여 일시적인 제공 중단이 발생할 수 있습니다.
            </li>
            <li>
              2. 회사가 제공하는 개별 서비스에 대한 구체적인 안내사항은 개별 서비스
              화면에서 확인할 수 있습니다.
            </li>
            <li>
              3. 회사가 제공하는 서비스의 내용은 다음과 같습니다.
              <ol>
                <li>
                  1. 웹페이지와 모바일 어플을 이용하여 승강기 관리에 필요한 정보를
                  제공하는 서비스
                </li>
                <li>2. 원격으로 승강기 실시간 움직임을 확인할 수 있는 서비스</li>
                <li>
                  3. 승강기 수리 및 검점 요청사항을 웹과 모바일을 통해 제공하는 서비스
                </li>
              </ol>
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제14조(서비스의 제한 등)</p>
          <ol>
            <li>
              1. 회사는 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나
              발생할 우려가 있는 경우와 전기통신사업법에 의한 기간통신사업자가
              전기통신서비스를 중지하는 등 부득이한 사유가 있는 경우에는 서비스의 전부
              또는 일부를 제한하거나 중지할 수 있습니다.
            </li>
            <li>
              2. 무료서비스는 전항의 규정에도 불구하고, 회사의 운영정책 등의 사유로
              서비스의 전부 또는 일부가 제한되거나 중지될 수 있으며, 유료로 전환될 수
              있습니다.
            </li>
            <li>
              3. 회사는 서비스의 이용을 제한하거나 정지하는 때에는 그 사유 및 제한기간,
              예정 일시 등을 지체없이 이용자에게 알립니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제15조(서비스의 해제·해지 및 탈퇴 절차)</p>
          <ol>
            <li>
              1. 이용자가 이용 계약을 해지하고자 할 때는 현대엘리베이터 영업사원을 통해
              MIRI 서비스 고객포탈 이용계약 해지를 요청할 수 있습니다.
            </li>
            <li>
              2. 회사는 이용자의 청약철회, 해제 또는 해지의 의사표시를 수신한 후 그 사실을
              이용자에게 회신합니다. 회신은 이용자가 회사에 대하여 통지한 방법 중 하나에
              의하고, 이용자가 회사에 대하여 통지한 연락처가 존재하지 않는 경우에는
              회신하지 않을 수 있습니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제16조(손해배상)</p>
          <ol>
            <li>
              1. 회사 또는 이용자는 상대방의 귀책에 따라 손해가 발생하는 경우 손해배상을
              청구할 수 있습니다. 다만, 회사는 웹서비스 및 모바일서비스의 장애, 제공 중단,
              보관된 자료 멸실 또는 삭제, 변조 등으로 인한 손해에 대하여는 배상책임을
              부담하지 않습니다.
            </li>
            <li>
              2. 회사가 제공하는 서비스의 이용과 관련하여 회사의 운영정책 및 개인 정보
              보호정책, 기타 서비스별 이용약관에서 정하는 내용에 위반하지 않는 한 회사는
              어떠한 손해에 대하여도 책임을 부담하지 않습니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제17조(면책사항)</p>
          <ol>
            <li>
              1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수
              없는 경우에는 서비스 제공에 관한 책임을 지지 않습니다.
            </li>
            <li>
              2. 회사는 이용자의 귀책사유로 인한 서비스 이용장애에 대하여 책임을 지지 지
              않습니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제18조(정보의 제공 및 광고의 게재)</p>
          <ol>
            <li>
              1. 회사는 이용자가 서비스 이용 중 필요하다고 인정되는 각종 정보 및 광고를
              배너 게재, 전자우편(E-Mail), 휴대폰 메시지, 전화, 우편 등의 방법으로
              이용자에게 제공(또는 전송)할 수 있습니다. 다만, 이용자는 이를 원하지 않을
              경우 회사가 제공하는 방법에 따라 수신을 거부할 수 있습니다.
            </li>
            <li>
              2. 이용자가 수신 거부를 한 경우에도 이용약관, 개인정보보호정책, 기타
              이용자의 이익에 영향을 미칠 수 있는 중요한 사항의 변경 등
              '정보통신망이용촉진 및 정보보호 등에 관한 법률'에서 정하는 사유 등 이용자가
              반드시 알고 있어야 하는 사항에 대하여는 전자우편 등의 방법으로 정보를 제공할
              수 있습니다.
            </li>
            <li>
              3. 제1항 단서에 따라 이용자가 수신 거부 조치를 취한 경우 이로 인하여 회사가
              거래 관련 정보, 이용 문의에 대한 답변 등의 정보를 전달하지 못한 경우 회사는
              이로 인한 책임이 없습니다.
            </li>
            <li>
              4. 회사는 '정보통신망법' 시행령에 따라 2년마다 영리 목적의 광고성 정보
              전송에 대한 수신동의 여부를 확인합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제19조(관할법원 및 준거법)</p>
          <ol>
            <li>
              서비스와 관련하여 분쟁이 발생한 경우 관할법원은 서울중앙지방법원으로 정하며,
              준거법은 대한민국의 법령을 적용합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p>부 칙</p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제1조(시행일)</p>
          <p>본 약관은 2023.06.01부터 시행됩니다.</p>
        </v-col>
      </v-row>
    </v-container>
    <v-container v-if="termsType == 'termsPlInfoUsingAg'">
      <v-card-title class="text-center mb-10">개인정보처리동의서</v-card-title>
      <v-row>
        <v-col>
          <p>
            현대엘리베이터(주)(이하 '회사'라고 합니다)는 개인정보보호법 등 관련 법령상의
            개인정보보호 규정을 준수하며 귀하의 개인정보보호에 최선을 다하고 있습니다.
            회사는 개인정보보호법에 근거하여 다음과 같은 내용으로 개인정보를 수집 및
            처리하고자 합니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p>
            다음의 내용을 자세히 읽어 보시고 모든 내용을 이해하신 후에 동의 여부를
            결정해주시기 바랍니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제1조(개인정보 수집 및 이용 목적)</p>
          <p>
            이용자가 제공한 모든 정보는 다음의 목적을 위해 활용하며, 목적 이외의 용도로는
            사용되지 않습니다.
          </p>
          <p>- 본인확인 및 승강기 유지보수 계약정보 확인</p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제2조(개인정보 수집 및 이용 항목)</p>
          <p>회사는 개인정보 수집 목적을 위하여 다음과 같은 정보를 수집합니다.</p>
          <p>- 성명, 전화번호 및 이메일</p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제3조(개인정보 보유 및 이용 기간)</p>
          <ol>
            <li>
              1. 수집한 개인정보는 수집·이용 동의일로부터 개인정보 수집·이용 목적을 달성할
              때까지 보관 및 이용합니다.
            </li>
            <li>
              2. 개인정보 보유기간의 경과, 처리목적의 달성 등 개인정보가 불필요하게 되었을
              때에는 지체없이 해당 개인정보를 파기합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제4조(동의 거부 관리)</p>
          <p>
            귀하는 본 안내에 따른 개인정보 수집·이용에 대하여 동의를 거부할 권리가
            있습니다. 다만, 귀하가 개인정보 동의를 거부하시는 경우에 서비스 이용 제한의
            불이익이 발생할 수 있음을 알려드립니다.
          </p>
          <p>
            본인은 위의 동의서 내용을 충분히 숙지하였으며, 위와 같이 개인정보를
            수집·이용하는데 동의합니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제5조(개인정보의 제3자 제공)</p>
          <p>
            회사는 개인정보보호법에 근거하여 다음과 같은 내용으로 개인정보를 제3자에게
            제공하고자 합니다.
          </p>
          <ol>
            <li>1. 개인정보를 제공 받는 제3자 : 현대엘리베이터서비스(주)</li>
            <li>2. 개인정보 제공 목적 : 본인확인, 계약정보 확인</li>
            <li>3. 개인정보 제공 항목 : 성명, 전화번호 및 이메일</li>
            <li>4. 개인정보 보유 및 이용기간 : 개인정보 수집, 이용을 달성할 때까지</li>
            <li>5. 개인정보 제공 거부 시 불이익 : 서비스 이용 제한</li>
          </ol>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p>
            본인은 위의 내용을 충분히 숙지하였으며, 위와 같이 개인정보를 제3자에게
            제공하는데 동의합니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col class="text-center">
          <p>2023년 06월 01일</p>
        </v-col>
      </v-row>
    </v-container>
    <v-container v-if="termsType == 'termsPlInfoStoreTimeAg'">
      <v-card-title class="text-center mb-10">개인정보처리방침</v-card-title>
      <v-row>
        <v-col>
          <p>
            현대엘리베이터(주)(이하 ‘회사'라고 함)는 회사가 제공하고자 하는 서비스(이하
            ‘회사 서비스’)를 이용하는 개인(이하 ‘이용자’ 또는 ‘개인’)의 정보(이하
            ‘개인정보’)를 보호하기 위해, 개인정보보호법, 정보통신망 이용촉진 및 정보보호
            등에 관한 법률(이하 '정보통신망법') 등 관련 법령을 준수하고, 서비스 이용자의
            개인정보 보호 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여
            다음과 같이 개인정보처리방침(이하 ‘본 방침’)을 수립합니다.
          </p>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제1조(개인정보 처리 목적·항목·보유기간)</p>
          <ol>
            <li>
              1. 회사 서비스는 다음과 같은 목적을 위하여 개인정보를 처리합니다. 처리하고
              있는 개인정보는 다음의 목적 이외의 용도로 이용되지 않으며, 이용 목적이
              변경되는 경우에는 개인정보보호법 제18조에 따라 해당 개인정보주체에게 별도의
              동의를 받는 등 필요한 조치를 이행합니다.
            </li>
            <table border="1">
              <thead>
                <tr>
                  <th>처리 목적</th>
                  <th>처리 항목</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>회원 가입 및 본인 인증</td>
                  <td>
                    회원가입 및 본인 인증 [필수] 이메일 주소, 비밀번호, 이름 및 휴대폰
                    번호 및 본인확인 값(CI,DI)
                  </td>
                </tr>
              </tbody>
            </table>
            <li>
              2. 회사는 이용자의 개인정보에 대해 개인정보의 수집·이용 목적이 달성을 위한
              기간 동안 개인정보를 보유 및 이용합니다. 다만, 회사는 내부 방침에 의해
              서비스 부정이용기록은 부정 가입 및 이용 방지를 위하여 회원 탈퇴 시점으로부터
              최대 1년간 보관합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제2조(개인정보의 3자 제공)</p>
          <ol>
            <li>
              1. 회사는 개인정보 제3자 제공 금지에도 불구하고, 이용자가 사전에 공개하거나
              다음 각호 사항에 대하여 동의한 경우에는 제3자에게 개인정보를 제공할 수
              있습니다. 다만 이 경우에도 회사는 관련 법령 내에서 최소한으로 개인정보를
              제공합니다.
            </li>
            <li>1&#41; 정보주체가 사전에 동의한 경우</li>
            <li>
              2&#41; 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에
              따라 수사기관의 요구가 있는 경우
            </li>
          </ol>
          <p>- 성명, 전화번호 및 이메일</p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제3조(개인정보의 파기원칙 및 방법)</p>
          <ol>
            <li>
              1. 회사는 원칙적으로 이용자의 개인정보 처리 목적의 달성, 보유·이용기간의
              경과 등 개인정보가 필요하지 않을 경우에는 해당 정보를 지체 없이 파기합니다.
            </li>
            <li>
              2. 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이
              달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는
              경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를
              달리하여 보존합니다. 3. 개인정보 파기의 절차 및 방법은 다음과 같습니다.
            </li>
            <li>1&#41; 파기 절차</li>
            <li>
              회사는 파기 사유가 발생한 개인정보를 개인정보보호 책임자의 승인절차를 거쳐
              파기합니다.
            </li>
            <li>2&#41; 파기 방법</li>
            <li>
              회사는 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적
              방법을 사용하여 삭제하며, 종이로 출력된 개인정보는 분쇄기로 분쇄하거나 소각
              등을 통하여 파기합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제6조(개인정보주제의 권리·의무 및 행사방법)</p>
          <ol>
            <li>
              1. 정보주체는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수
              있으며 정보삭제 및 처리정지를 요청할 수도 있습니다. 정보삭제 또는 처리정지를
              원하시는 경우 개인정보보호 책임자에게 이메일로 연락하시면 지체 없이
              조치하겠습니다.
            </li>
            <li>
              2. 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의 부정확한
              정보 입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.
            </li>
            <li>
              3. 타인의 개인정보를 도용한 회원가입의 경우 이용자 자격을 상실하거나 관련
              개인정보보호 법령에 의해 처벌받을 수 있습니다.
            </li>
            <li>
              4. 이용자는 전자우편주소, 비밀번호 등에 대한 보안을 유지할 책임이 있으며
              제3자에게 이를 양도하거나 대여할 수 없습니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제7조(개인정보 안전성 확보조치)</p>

          <ol>
            <li>1. 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.</li>
            <li>
              1&#41; 관리적 조치 : 내부관리계획 수립·수행, 전담조직 운영, 정기적인 직원
              교육
            </li>
            <li>
              2&#41; 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템
              설치, 개인정보의 암호화, 보안프로그램 설치 및 갱신
            </li>
            <li>3&#41; 물리적 조치 : 전산실, 자료보관실 등의 접근 통제</li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제9조(형태정보의 수집이용 및 거부등에 관한사항)</p>

          <ol>
            <li>
              1. 서비스 이용과정에서 정보주체에게 최적화된 맞춤형 서비스 및 혜택, 온라인
              맞춤형 광고 등을 제공하기 위하여 형태정보를 수집 이용하고 있습니다.
            </li>
            <li>2. 다음과 같은 형태정보를 수집합니다.</li>
            <table border="1">
              <thead>
                <tr>
                  <th>수집 형태정보</th>
                  <th>형태정보 수집 방법</th>
                  <th>형태정보 수집 목적</th>
                  <th>보유 이용기간 및 이후 정보 처리 방법</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>이용자의 웹사이트/앱서비스 방문이력, 검색이력</td>
                  <td>이용자의 웹 사이트 및 앱방문/실행시 자동 수집</td>
                  <td>이용자의 관심, 성향에 기반한 개인 맞춤형 상품 추천 서비스</td>
                  <td>업무목적 달성 까지</td>
                </tr>
              </tbody>
            </table>
            <li>
              3. 온라인 맞춤형 광고 등에 필요한 최소한의 형태정보만을 수집하며, 사항,
              신념, 가족 및 친인척관계, 학력 병력, 기타 사회활동 경력 등 개인의 권리
              이익이나 사행활을 뚜렷하게 침해할 우려가 있는 민감한 형태정보를 수집하지
              않습니다.
            </li>
            <li>
              4. 모바일 앱에서 온라인 맞춤형 광고를 위하여 광고식별자를 수집 이용합니다.
              정보주체는 모바일 단말기의 설정 변경을 통해 앱의 맞춤형 광고를 차단 허용할
              수 있습니다.
            </li>
            <li>
              1&#41; 안드로이드 : 설정 > 개인정보보호 > 광고 > 광고 ID 재설정 또는 광고 ID
              삭제
            </li>
            <li>
              2&#41; 아이폰 : 설정 > 개인정보보호 > 추적 > 앱이 추적을 요청하도록 허용 끔
            </li>
            <li>※ 모바일 OS 버전에 따라 메뉴 및 방법이 다소 상이할 수 있습니다.</li>
            <li>
              5. 정보주체는 웹브라우저의 쿠키 설정 변경 등을 통해 온라인 맞춤형 광고를
              일괄적으로 차단 허용할 수 있습니다. 다만, 쿠키 설정 변경은 웹사이트
              자동로그인 등 일부 서비스의 이용에 영향을 미칠 수 있습니다.
            </li>
            <li>1&#41; 인터넷 익스플로러(Windows 10 Internet Explorer 11)</li>
            <li>- Internet Explorer에서 도구 버튼을 선택한 다음 인터넷 옵션을 선택</li>
            <li>
              - 개인 정보 탭을 선택하고 설정에서 고급을 선택한 다음 쿠키의 차단 또는 허용
              선택
            </li>
            <li>2&#41; Microsoft Edge</li>
            <li>- Edge에서 오른쪽 상단 ‘…’ 표시를 클릭한 후, 설정을 클릭합니다.</li>
            <li>
              - 설정 페이지 좌측의 ‘개인정보, 검색 및 서비스’를 클릭 후 『추적방지』
              섹션에서 ‘추적방지’ 여부 및 수준을 선택합니다.
            </li>
            <li>
              - ‘InPrivatefmf 검색할 때 항상 “엄격” 추적 방지 사용’ 여부를 선택합니다.
            </li>
            <li>
              - 아래 『개인정보』 섹션에서 ‘추적 안함 요청보내기’ 여부를 선택 합니다.
            </li>
            <li>3&#41; 크롬 브라우저</li>
            <li>
              - Chrome에서 오른쪽 상단 ‘⋮’ 표시(chrome 맞춤설정 및 제어)를 클릭한 후, 설정
              표시를 클릭합니다.
            </li>
            <li>
              - 설정 페이지 하단에 ‘고급 설정 표시’를 클릭하고 「개인정보」 섹션에서
              콘텐츠 설정을 클릭합니다.
            </li>
            <li>
              - 쿠키 섹션에서 ‘타사 쿠키 및 사이트 데이터 차단’의 체크박스를 선택합니다
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제10조(개인정보보호책임자)</p>

          <ol>
            <li>
              1. 회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기
              위하여 아래와 같이 관련 부서 및 개인정보 보호 책임자를 지정하고 있습니다.
              <ol>
                <li>
                  1. 개인정보 보호 책임자
                  <ol>
                    <li>1.성명 : 김응도</li>
                    <li>2.직책 : 디지털혁신본부장</li>
                  </ol>
                </li>
                <li>
                  2. 개인정보 보호 담당팀
                  <ol>
                    <li>1.담당부서 : IT기획팀</li>
                    <li>2.담당자명 : 변진수 팀장</li>
                    <li>3.이메일 : jeansu.byun@hyundaielevator.com</li>
                  </ol>
                </li>
              </ol>
            </li>
            <li>
              2. 회사는 개인정보의 보호를 위해 개인정보보호 전담부서를 운영하고 있으며,
              개인정보처리방침의 이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될
              경우 즉시 해결하고 바로 잡을 수 있도록 최선을 다하고 있습니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제11조(개인정보 열람청구)</p>

          <ol>
            <li>
              1. 정보주체는 개인정보보호법 제35조에 따른 개인정보의 열람 청구를 아래의
              부서에 할 수 있습니다. 회사는 정보주체의 개인정보 열람청구가 신속하게
              처리되도록 노력하겠습니다.
              <p class="smallBoldText">개인정보 열람청구 접수 처리팀</p>
              <ol>
                <li>- 팀명 : IT기획팀</li>
                <li>- 담당자 : 변진수 팀장</li>
                <li>- 이메일 : jeansu.byun@hyundaielevator.com</li>
              </ol>
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제12조(권익침해 구제방법)</p>

          <ol>
            <li>
              1. 정보주체는 아래의 기관에 대해 개인정보 침해에 대한 피해구제, 상담 등을
              문의하실 수 있습니다.
              <p>
                아래의 기관은 회사와는 별개의 기관으로서, 회사의 자체적인 개인정보
                불만처리, 피해구제 결과에 만족하지 못하시거나 보다 자세한 도움이
                필요하시면 문의하여 주시기 바랍니다.
              </p>
              <p class="smallBoldText">개인정보침해 신고센터 (한국인터넷진흥원 운영)</p>
              <ol>
                <li>- 소관업무 : 개인정보 침해사실 신고, 상담 신청</li>
                <li>- 홈페이지 : privacy.kisa.or.kr</li>
                <li>- 전화 : (국번없이) 118</li>
                <li>- 주소 : (58324) 전남 나주시 진흥길 9 3층 개인정보침해 신고센터</li>
              </ol>
              <p class="smallBoldText">개인정보 분쟁조정위원회</p>
              <ol>
                <li>- 소관업무 : 개인정보 분쟁조정신청, 집단분쟁조정 (민사적 해결)</li>
                <li>- 홈페이지 : www.kopico.go.kr</li>
                <li>- 전화 : 1833-6972</li>
                <li>- 주소 : (03171) 서울시 종로구 세종대로 209 정부서울청사 4층</li>
              </ol>
              <p class="smallBoldText">대검찰청 사이버수사과</p>
              <ol>
                <li>- 전화 : (국번없이) 1301</li>
                <li>- 홈페이지 : http://spo.go.kr</li>
                <li>- 경찰청 사이버안전국</li>
                <li>- 전화 : (국번없이) 182</li>
                <li>- 홈페이지 : http://cyberbureau.police.go.kr</li>
              </ol>
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제13조(개인정보 처리방침의 변경)</p>

          <p>이 개인정보 처리방침은 2023. 06. 01부터 시행됩니다.</p>
        </v-col>
      </v-row>
    </v-container>
    <v-container v-if="termsType == 'termsAdRecvAg'">
      <v-card-title class="text-center mb-10"
        >광고 및 마케팅 수신 동의 약관 (선택)</v-card-title
      >
      <v-row>
        <v-col>
          <p>
            현대엘리베이터(주)(이하 '회사'라고 합니다)는 개인정보 보호법 제22조 제4항과
            제39조의 3에 따라 사용자의 광고성 정보 수신과 이에 따른 개인정보 처리에 대한
            동의를 받고 있습니다. 약관에 동의하지 않으셔도 회사의 모든 서비스를 이용하실
            수 있습니다. 다만 이벤트, 혜택 등의 제한이 있을 수 있습니다.
          </p>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p>
            다음의 내용을 자세히 읽어 보시고 모든 내용을 이해하신 후에 동의 여부를
            결정해주시기 바랍니다.
          </p>
        </v-col>
      </v-row>

      <v-row>
        <v-col>
          <p class="smallBoldText">제1조(개인정보 수집 이용 목적)</p>
          <p>
            이용자가 제공한 모든 정보는 다음의 목적을 위해 활용하며, 목적 이외의 용도로는
            사용되지 않습니다.
          </p>
          <ol>
            <li>- 이벤트 운영 및 광고성 정보 전송</li>
            <li>- 서비스 관련 정보 전송</li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제2조(개인정보 수집 및 이용 항목)</p>
          <p>회사는 개인정보 수집 목적을 위하여 다음과 같은 정보를 수집합니다.</p>
          <ol>
            <li>- 성명, 전화번호 및 이메일</li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제3조(개인정보 보유 및 이용 기간)</p>
          <ol>
            <li>
              1. 수집한 개인정보는 수집·이용 동의일로부터 개인정보 수집·이용 목적을 달성할
              때까지 보관 및 이용합니다.
            </li>
            <li>
              2. 개인정보 보유기간의 경과, 처리목적의 달성 등 개인정보가 불필요하게 되었을
              때에는 지체없이 해당 개인정보를 파기합니다.
            </li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제4조(동의 철회 방법)</p>
          <p>
            귀하는 본 안내에 따른 개인정보 수집·이용에 대하여 동의를 거부할 권리가
            있습니다. 다만, 귀하가 광고 및 마케팅 수신 동의를 거부하시는 경우에 이벤트,
            혜택 등의 제한이 발생할 수 있음을 알려드립니다.
          </p>
          <ol>
            <li>- 개인정보관리 페이지에서 변경</li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제5조(전송 방법)</p>
          <p>회사는 광고 및 마케팅 송신의 목적을 위하여 다음과 같은 경로로 전송합니다.</p>
          <ol>
            <li>- 핸드폰 문자메시지(SMS), 웹 및 핸드폰 푸시 알림, E-mail 등</li>
          </ol>
        </v-col>
      </v-row>
      <v-row>
        <v-col>
          <p class="smallBoldText">제6조(전송 내용)</p>
          <p>
            회사는 광고 및 마케팅 송신의 목적을 위하여 다음과 같은 내용으로 전송합니다.
          </p>
          <ol>
            <li>
              - 혜택 정보, 이벤트 정보, 상품 정보, 신규 서비스 안내 등의 광고성 정보 제공
            </li>
          </ol>
        </v-col>
      </v-row>
    </v-container>
  </v-sheet>
</template>
<style scoped>
li {
  list-style: none;
  line-height: 1.8;
}
li > ol > li {
  padding-left: 20px;
}
td {
  padding: 12px;
}
</style>
